[{
        "title": " Advisor",
        "image": "committe/AD/BBhatPA.jpeg",
        "name": "Dr. Bheem Bhat ",
        "address": "PA",
        "description": "Bheem Bhat is originally from Alike Village of TuLunadu, near Vittala town.Studied BSc in St Aloysius College, Mangaluru, MSc in KMC, Manipal & PhD(Medical Microbiology) in WHO center, Delhi U, and Post - Doctoral Research at Wash Uni Med Sch, St.Louis, MO.Worked as a BioPharma R & D scientist for 20 + years in the suburbs of Philadelphia.  \nOnce retired from Scientific Research, Bheem has been serving the local community members needs in Real Estate as a Realtor and in Yoga as a Certified Yoga Instructor. He has also been volunteering for 15 + years enthusiastically as a Judge for Science Fairs K4 - K12 to encourage local budding scientists and as a mentor for K4 - K12 in science & service projects.He has been a supporter of the vision and mission of several service organizations including SEWA international, AIM for SEVA, Shankara Eye Foundation & Ekal Vidyalaya. Bheem has been involved in promoting culturally enriching organizations such as Chinmaya Mission Balavihar, Sruti Classical Music & Dance Society of Philadelphia, local Kannada Koota & Havyaka Association North East chapter.Bheem also got an opportunity a few years ago to serve as the President of Havyaka Association of Americas."
    },
    {
        "title": " Advisor",
        "image": "committe/AD/GPFL.jpeg",
        "name": "Dr. Guru Prasad ",
        "address": "FL",
        "description": "Guru Prasad is a Mechanical and Aerospace engineer and originally from Udupi.He worked as a scientist for ISRO and came to Orlando, Fl in 89. He persued his MS and PhD at Univ of Central Florida and was a scientist at Simulation Institute and adjunct faculty.He worked at Lockheed Martin Advanced Technology labs and at Aximetric building simulators and simulations for aerospace and military.Dr.Prasad was a volunteer at Hindu Univ. Of America, Hindu Society and organized lectures, Yakshagana, concerts and founder at Orlando Kannada Sangha and in organizing AKKA conf. in Orlando.He was founder of Topie.com set to promote hitech startups in C.Florida.Dr.Prasad developed an Indic keyboard and one for Tulu also. He is currently in India for last four years and started Kanaada Phonetics for manufacturing and establishing language labs in Tulunad and Made in India Indic keyboards to promote digital literacy of Tulu."
    },
    {
        "title": " Advisor",
        "image": "committe/AD/SJIL.jpeg",
        "name": "Shrestha Jay ",
        "address": "IL",
        "description": "Born and brought up in Kukke Subramanya.Works as Senior Director of IT for a fortune 500 company in Chicago. Past president and advisory board chair of Vidyaranya Kannada Kuta, Chicago. Founding member and chairperson of Shivalli Kutumba of North America.Founding member of KAVANA, USA."
    },
    {
        "title": " Advisor",
        "image": "committe/AD/SJoshiVA.jpeg",
        "name": "Shrivathsa Joshi",
        "address": "VA",
        "description": "Born and brought up in Maala village of Karkala taluk, Udupi district, studied in Kannada medium till SSLC. He did his Engineering in Computer Science from Govt BDT College of Engineering Davangere.After working for a Govt of India enterprise at Delhi and Hyderabad, he moved to the USA in the year 2000. Now he works for IBM as a Software architect and lives in the Washington DC area with wife Sahana and son Srujan.  \nWith keen interest in Kannada language, literature, culture and fine arts, Srivathsa Joshi is an active member of the Kaveri Kannada Association of Washington DC.As a hobby, Srivathsa Joshi started writing for Kannada newspapers and periodicals.From past 18 years he has been writing weekly columns in various Kannada news portals and newspapers such as thatskannada.com, Vijaya Karnataka and Vishwavani.Till date 13 books of these column write - ups have been published, of which 5 have made it to the Library of Congress - world 's largest library located in Washington DC.  The present weekly column 'Tiliru Torana' in Vishwavani, gets published every week as podcast too and is quite popular in social media.  \n Srivathsa Joshi has been publishing a weekly series titled 'Swaccha Bhaashe Abhiyaana' in social media since past 3 years, about correct grammatical usage of Kannada.Many have found it quite useful in refreshing their Kannada knowledge.  \n Last but not the least, Tulu is one among nine languages Srivathsa Joshi is conversant with! (Marathi, Kannada, Konkani, Samskritha, Hindi, Telugu, Tamil, and English the other eight)"
    },
    {
        "title": " Advisor",
        "image": "committe/AD/SPrabhuMA.jpeg",
        "name": "Sudhir Prabhu ",
        "address": "MA",
        "description": "Born in Ganjimata near Mangalore.Grew up in Udupi.Studied at Christian High School. Then went on to complete PUC at Manipal Junior College.Completed Engineering at Manipal Institute of Technology. Moved to US in 1992 for graduate studies at New Mexico State University.Moved to Boston in 1995. Been in the financial services industry since 2004, presently working at Morgan Stanley in Boston. Currently residing in Acton MA with wife, 2 teenagers and a dog.  \n With keen interest in Kannada language, literature, culture and fine arts, Srivathsa Joshi is an active member of the Kaveri Kannada Association of Washington DC.As a hobby, Srivathsa Joshi started writing for Kannada newspapers and periodicals.From past 18 years he has been writing weekly columns in various Kannada news portals and newspapers such as thatskannada.com, Vijaya Karnataka and Vishwavani.Till date 13 books of these column write - ups have been published, of which 5 have made it to the Library of Congress - world 's largest library located in Washington DC. The present weekly column 'Tiliru Torana' in Vishwavani, gets published every week as podcast too and is quite popular in social media.  \n Srivathsa Joshi has been publishing a weekly series titled 'Swaccha Bhaashe Abhiyaana' in social media since past 3 years, about correct grammatical usage of Kannada.Many have found it quite useful in refreshing their Kannada knowledge.  \n Last but not the least, Tulu is one among nine languages Srivathsa Joshi is conversant with!(Marathi, Kannada, Konkani, Samskritha, Hindi, Telugu, Tamil, and English the other eight)"
    }
]