[
    {
        "title": " Ambassador",
        "image": "committe/RA/ANaikCA.jpeg",
        "name": "Anitha Naik",
        "address": "CA",
        "description": "Software management professional with a passion for social development in four pillars, namely education, holistic health, creative art and cultural heritage. Lives in California 's San Francisco Bay Area with her husband. Works as a program leader for software products at one of the Big Five technology companies.  When not working, enjoys painting and community activities. Performed singing, dance and Yakshagana at cultural events.   \nBorn and raised in coastal city Mangalore listening to sweet sounding Tulu bridging the hearts, and cherishing Tuluva culture being the way of life. Member of Tulu speaking families from both parents ' side, mother from Puttur and father from Mangalore.   \nBrings 20 + years of social impacting experience in nonprofits dedicated to education in India(ASHA for Education, FFE), community health(IndiaCC) and culture(KKNC, BANA) as a member of executive and functional committees.Founded holistic health services company and trained communities on Yoga and Ayurvedic lifestyle. Founded Tuluvas group in the bay area with the purpose of preserving Tulu language and culture."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/ADNC.jpeg",
        "name": "Avil D'Souza",
        "address": "NC",
        "description": "Avil Dsouza has been a resident of Morrisville, North Carolina since 2015 and is a proud member & current president of the Tulu association, Triangle Tuluvere Chavadi.Avil moved to the states with his wife, Seema Viswanath, who is a classical dance performer / teacher.Seema has been choreographing dances for various cultural associations which has led to the introduction of a lot of Tuluvas in the Triangle area.Avil is proud to be one of the earliest members of Triangle Tuluvere Chavadi, NC and has a lot of friends who are Tuluvas.He has been actively involved in various Tulu activities such as organizing picnics, annual cultural events, fundraisers, hosting Yakshagana artists, representing Tulunadu in Kannada association programs etc.Despite Konkani being his mother tongue, he feels more comfortable to converse in Tulu and looks forward to every opportunity to meet up with Tulu families. Avil loves watching / playing sports and is involved in various sports such as cricket, soccer, volleyball, badminton and table tennis. Due to his wife 's connection to the field of arts, Avil is also involved in the cultural scene of the Triangle area.   \nAvil 's native place is Sanoor, Karkala and he graduated in Commerce from Nitte college, Nitte. Avil's parents live in Sanoor and their association with the Tulu community there has ingrained the love for Tulu in Avil 's heart & mind."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/KShettyGA.jpeg",
        "name": "Kumar Shetty",
        "address": "GA",
        "description": "Sukumar Shetty - goes by Kumar, is a transportation specialist and is currently engaged for a transportation company in Atlanta, GA, as an operations manager.Both his parents are from Padubidri - Avaral Matt and being the older child in the family, was born in Padubidri and later pursued school and college in Mumbai.Tulu has been the primary language of communication at home and also around his native places in Padubidri and with relatives.Moved to the USA, in 2010 and since then he had been in and around Atlanta, GA, with his wife Kanthi Shetty.He is an active volunteer of Shri Krishna Vrundavana Temple, Atlanta, GA and also a member of BAANA.Loves to interact with Tulu speaking individuals and watch a lot of Tulu channels online."

    },
    {
        "title": " Ambassador",
        "image": "committe/RA/PShettyWA.jpeg",
        "name": "Pavithra Shetty",
        "address": "WA",
        "description": "My name is Pavthra Shetty.I was born and raised in Bhadravathi, India.My father is from Agrabail, Udupi and mother is from Katkeri, Kundapura. Currently, I am a homemaker living in Snoqualmie, Washington State.I love dancing, outdoor activities and travelling to new places."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/PJShettyMI.jpeg",
        "name": "Prajwal Shetty",
        "address": "MI",
        "description": " Born in Mangalore and raised in Bangalore has always been very much associated with his roots(tulunadu) and the tulu language.His parents made sure that the whole family visited their hometown at least twice a year growing up, which has kept him attached to the culture and traditions of tulunadu.Prajwal 's paternal house is in padubidri (Santoor) and his maternal house is in Kaikamba.   \nPrajwal Moved to the U.S.to pursue his master 's in the year 2012 and has been living in Detroit, Michigan ever since.  Married to Akshatha Shetty for 2 years now and they have been actively participating and serving in the kannada koota and other Indian community related events in Michigan.   \nPrajwal along with his friend(Manas) started the Michigan Tulu Koota group to unite and bring together all the tuluvas in the Michigan area. The group started off as a community with only 4 members and today it proudly boasts of having over 100 families come together as one. Prajwal has also actively participated in many Stage shows, tulu natakas and even a few short movies."
            
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/PLaxman.jpeg",
        "name": "Prasanna Lakshman",
        "address": "MA",
        "description": "Prasanna Lakshman is a Technologist by profession with Computer Science background.He lives in Acton, Massachusetts with his family.   \nHe was brought up in Kolar Gold Fields(KGF) as a Tuluva where he did his early education and later moved to Bangalore and then to the USA. His dad is from Kavoor, Mangalore and mom from Sringeri and has roots in Udupi & Dakshina Kannada district.   \nPrasanna has been involved with the England Tulu Koota(NETK) since its inception and he is the current Secretary of this organization. He initiated and organized the spoken Tulu & Tulu script classes in the USA.He also knows how to read and write in Tulu.He is an active member involved with other local organizations as well.He loves music and likes to sing during his free time.He likes Yakshagana and watches it during his free time. He is a sports enthusiast and loves to watch Soccer, Cricket, American football and various other sports."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/RamKanchan.jpeg",
        "name": "Ram Kanchan",
        "address": "NY",
        "description": "Born in Kumbashi(Anegudde) and brought up in Santekatte Udupi and Mumbai.Did early schooling and college at St.Xavier 's College Mumbai,  Joined Hospitality Industry at the age of 21 also worked 16 years at Royal Caribbean International.Currently living in Long Island NY since 2002 and partnered with AOA Bar and Grill NYC.   \n Married to Sudha Kanchan with one son - Aryan.   \n A big proponent of Tulu language and talks only in Tuluand Kannada at home and with family. As a family they have made it close to compulsory to visit Udupi / Kundapura at least once or more every year and have done this since 2020 until COVID."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/RShettyMN.jpeg",
        "name": "Rithesh Shetty",
        "address": "MN",
        "description": "Chemical Engineer by Education.Born & Brought up in BOMBAI(as we all say it) Mother from Ambalpady(Syndicate Bank) & Father from Upoor. Kavathar(Mulky) - is my Native home.   \nI work as Sr Project Manager for HCL America Inc.Stay in Minneapolis since 2012. With Wife Preeti & Daughter - Thanishka   \n Do a lot of biking & walking.I enjoy walking even in the most terrible winters. Watch & hear a lot of Tulu natakas & Videos.Have seen some good Atas in 1990--2000 Very Fluent in speaking Tulu."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/ShShettyCA.jpeg",
        "name": "Santhosh Shetty",
        "address": "CA",
        "description": "Santhosh Shetty works as a Director of Cloud & Software development in a California based Software Company. He holds a master 's degree in computer science and worked for various multinational software companies as Software professional in Mangalore and Bangalore prior moving to Charlotte, North Carolina, USA in 2011. Later he moved to Salt Lake City, Utah in 2015. Currently he lives in Los Angeles, California with his wife Bhagya, son Lalith and daughter Prisha.   \nSanthosh was born in Sullia, Dakshina Kannada and grew up in the same city by watching and being part of the beautiful arts of the Tulunadu like Yakshagana, Aata, Nema, Kola, Kambala, Tambila and unique festivals like Bali Padyami, Keddasa, bisu parba etc. His agricultural family background helped him to develop a strong bondage and respect in Tulu culture.   \n Inspired by the thoughts of the great Swami Vivekananda at a young age, he volunteered to organize various charitable activities at state level back in India, including organizing student programs, fundraising and cultural events.His passion for connecting people helped in expanding the Karavali group in outhern California and organizing yakshagana programs in the region in 2019. Santhosh is also actively involved in various charity programs especially helping underprivileged students in India."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/SValli.jpeg",
        "name": "Shreevalli Rai Martell",
        "address": "FL",
        "description": "Shreevalli Rai Martell has been living in Florida since January 2010 with her husband and daughter. Her job as a Legal Counsel at a reputed Anti - Money Laundering(AML) and Governance Risk and Compliance(GRC) provider required her to move to the United States. She initially joined this company in April 2008. Rai Martell started her journey with this firm at a client location in Bangalore, India. Prior to this, she practiced Civil Law in Mangalore District Court between 2004 and 2008.   \nRai Martell was born and raised in a remote village in Belthangady, a local administrative region about 60 minutes away from the city of Mangalore. Art has always been running the family, her father was a Yakshagana artist, a government employee and an Agriculturist.Yakshagana is a traditional folk theatre form mostly practiced in coastal regions of Indian state of Karnataka.Her grandfather was also a Yakshagana Bhagavata, the chief narrator of the play. Rai Martell 's mother is a homemaker and takes care of the family farm. Growing up with two siblings, she has always been inclined towards arts and culture, She practiced singing Indian classical music.She graduated with a Bachelor of Arts(BA) degree from SMC college in Moodabidri and later with a Bachelor of Legislative Law(LLB) from the SDM Law College(affiliated with Karnataka State Law University) in Mangalore. She was appointed as a Cultural Secretary and Joint Secretary at SMC college, and later as a Joint Secretary at SDM law college.  \nIn 2015, Rai Martell decided to take a break from her corporate career to take care of her family and to pursue her interest in music, embossing, quilling and other paper arts.In 2021, she founded Florida Tulu Koota and is currently involved with organizations promoting Tulu culture in India and overseas. Rai Martell 's aim is to help the immigrant communities and second generation of Tulu origin in the United States, especially in Florida, to connect with each other and stay in touch with their culture.She is currently learning to read and write Tulu 'lipi'(script) to further broaden her horizons.Rai Martell likes traveling, exploring new culture and cuisines. Florida 's beaches, the warm weather, coconut and mango trees reminds her of hometown Mangalore."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/SiShettyTX.jpeg",
        "name": "Siddharth Shetty",
        "address": "TX",
        "description": "Siddharth pursued his Master 's in Electrical Engineering from Texas A&M University and moved to Houston, Texas in the year 2011 where he started working for an Oil and Gas company as an Electrical Design Engineer in Automation.  \n Active member of Bunts Association of North America and currently the BANA regional Representative for the Southwest region.He is actively involved with Bhajane, volunteering, fund raising and Charity events as part of the Houston bunts group. He also is an active member of the Houston Kannada Vrinda and the Udupi temple and has served both those organizations in various capacities.   \nBorn and raised in Bangalore where he did his schooling and Engineering.His roots are from the very heart of the Tulu speaking region Mangalore. Paternal ancestral home is in Kolnaadu and mothers native place is Kinnigoli near Kateel.The regular visits to grandparents place have kept him rooted to the Tulu culture and watching festivities like Kambala and Buta Kola have made him appreciate the Tulunadu traditions.He has participated in several cultural programs like singing, dancing, drama, short movies and the most beautiful yet most challenging art form Yakshagana which he performed in Houston, Texas in 2019 for a Kannada Sangha event. Siddharth has had the privilege to represent the country in swimming at the World Swimming Championship 2012."
    },
    {
        "title": " Ambassador",
        "image": "committe/RA/UKMO.jpeg",
        "name": "Umashankar Kadambar",
        "address": "MO",
        "description": "Umashankar Kadambar was born in Mangalore and brought up in Khopoli, Maharashtra where his dad used to work for Zenith Steel Pipes. His dad is from Kadambar(close to Manjeshwar) and mom from Neermarga. \nHe moved to the US in 2007, but has been living in St Louis since 2013, with his family(wife and twin daughters).He works as a Project Manager - ERP implementation. Actively involved as a volunteer in several not for profit organizations promoting Bhartiya Classical music and Yakshagana. \nSpeaks Tulu at home with family and is connected to his roots in Dakshina Kannada and Udupi."
    }
]