[
    {
        "title": "Chairperson",
        "image": "committe/BOD/SAlvaCA.jpeg",
        "name": "Dr. Shridhar Alva",
        "address": "Pleasenton, CA",
        "description": "Scientist by profession in a healthcare industry, Dr.Shrdhara Alva has been living in California since 2004 with his wife Sujna and son Ishaan. Born and brought up in Karinka, Bantwal, finished early schooling around Neralakatte and Puttur.He received his Master 's degree in Chemistry from Mangalore UUniversity and PhD from Tata Institute of Fundamental Research, Mumbai. He moved to the United States in 1994 as a Postdoctoral Fellow at University of Massachusetts of Lowell.\n Dr.Alva is an active member of Bunts Association of North America, served in various roles in the regional and national levels over the years. He has a passion for Yakshagana, and serves as the Secretary of Yakshadhruva Patla Foundation USA, organized to support the artists and the art. He is actively involved in the Tulu associations in the Bay area."
    },
    {
        "title": "Director",
        "image": "committe/BOD/ABNY.jpeg",
        "name": "Ajith Bhaskar Shetty",
        "address": "Hicksville, NY",
        "description": "Ajith Bhaskar Shetty was born and brought up from Mysore India.He was graduated in computer science and moved to the USA in 2006 and settled in NY.He Currently holds COO(Chief Operating Officer) Position in Cricmap, developing a product for enhancing Batting skills.He is a good allrounder and has been playing cricket for more than 25 years and still playing in his leisure. \nAjith roots are from Sringeri and Udupi.He has spent most of his time in Mysore, studied his engineering in chikmagalur and worked in Bangalore for few years. He is currently one of the Board of Directors for USA Cricket.He has served as Co - chair of the Cricket Committee.Under his term, the USA has achieved ODI Status in 2019. Currently, he is serving as chair for the Strategy committee and working on 1 st ever strategy for USA Cricket after the formation of the new Board.He manages multiple Cricket Organizations.He is also President of NYTBCL and Kannada Koota NY.He started the many petition to get the grounds and helping senator for Empire state Task force, which is proposed to understand and develop cricket in NY.0 ver the years Ajith Bhaskar worked hard to nurture and grow the cricket in New York area.The capacity and commitment to serve the sport is undoubted.Past few years he is very aggressive in acquiring ground, promoting cricket for youth, and finding sponsors for league and Clubs.Managing a large league like Commonwealth cricket league with more than 2000 players is a mammoth task and with his vision and experience he is setting up the right policies and rules to run the show smoothly. He had conducted many coaching camps for Kids and a great advocate of cricket in the local community."
    },
    {
        "title": "Director",
        "image": "committe/BOD/MCCA.jpeg",
        "name": "Dr. Mohanchandra KP",
        "address": "Los Angeles, CA",
        "description": "Dr.Mohanchandra KP was born in Kasaragod and brought up in Kotekar, Mangalore.He received Master's degree in Physics and Ph.D. in Materials Science from  Mangalore University.Before moving to the US, he was a lecturer in the department of Materials Science, Mangalore University.Currently, he is working as a Senior Research Scientist at the Mechanical and Aerospace Engineering Department, University of California Los Angeles, and has been living with his wife Indumathi and daughter Pranathi in Los Angeles, CA, since 2000. \nDr.Mohanchandra served in various capacities on boards, committees of Karnataka Cultural Association, Southern California(KCA - SC) and is passionate about Yakshagana, Drama and other cultural activities.He is also one of the founders of Karavali - SC, an organization which serves to unite people from Karavali(Kasaragod, Dakshina Kannada & Udupi Districts) in southern California."
    },
    {
        "title": "Director",
        "image": "committe/BOD/PKumarMI.jpeg",
        "name": "Prashanth Kumar",
        "address": "Troy, MI",
        "description": "Techie by profession with Electrical background, living in Troy,  MI since 2016. Born and brought up in Mattu Kopla, Udupi. He did Engineering from Mangalore University and Masters from Manipal University.Mother tongue is Tulu. Parents are from Mattu.Father is Laxman Rao, who is Naga Pathri & priest of Mattu Brahmalingeshwara Temple.\n Engaged himself in various community activities related to Tulu, Kannada and religious activities.Back in India, he did volunteer service in temples and played a different role in various community groups. He is one of the founding members of Shivalli Kutumba of North America and currently serving as a President.\n Very passionate about Yakshagana, engaged himself in Tulu Drama and other cultural activities. He is serving as lead committee members of the Detroit Yakshagana Sangha. Currently continuing learning Badagu tittu Yakshagana dance."
    },
    {
        "title": "Director",
        "image": "committe/BOD/PShettyMN.jpeg",
        "name": "Prithi Shetty",
        "address": "Plymouth, MN",
        "description": "Prithi Shetty is a Computer Science Engineering Graduate from VIT, Belgaum and has been working as Project Manager for 16 years  in IT industry.Minnesota has been her home for the past decade.Thanks to her father 's job in Vijay Bank, she has grown up in  different cities in Maharashtra, Assam & Karnataka.Her parents are from Bailur & Pandibettu in Udupi district.Growing up outside Kannada, meant Tulu was the link to parents & extended family.Only as a grown up, did she realize the magnitude of Tulu reach. She is very fond of watching Yakshagana. Her sport is Running and she has completed 20 + Half Marathons & 2 Full Marathons."
    },
    {
        "title": "Director",
        "image": "committe/BOD/RSherigarVA.jpeg",
        "name": "Dr. Rathnakar Sherigar",
        "address": "Roanoke, VA",
        "description": "Dr.Rathnakar Sherigar has been living in the United States since 1995, currently resides in Roanoke Virginia since 2002 with his wife Reshma and 3 kids, Nikheel, Nikitha and Nishanth.He moved to United States from Delhi in 1995 to pursue Residency training in Internal medicine, Diagnostic Radiology, Interventional Radiology and Endovascular Medicine.Currently he is practicing at Carilion Clinic hospitals Roanoke VA and VAMC Salem Virginia. He is an Associate Professor of Clinical Medicine at University OF Virginia Charlottesville, VA.\nBorn and brought up in Maala Karkala.His father is from Maala and mother is from Kellaputhige - Marnad in Moodabidri. After his early education at Sri Gurukula primary school, he completed PUC at Bhuvanendra College Karkala. He completed his Medical School in Mysore and additional post doctoral study at University of Delhi. \nHe is actively involved with Association of physicians of Indian subcontinent and other Indian associations. He is a strong supporter of Indian heritage and culture. His wife is an accomplished Bollywood and bharathnatyam dance artist.He loves playing chess and Badminton.\nHe is very enthusiastic about Tulu culture including yakshyagana, Booths Kola, Tulu Nataka, Tulu Movies and tuluva parampare."
    },
 {
        "title": "Director",
        "image": "committe/BOD/SBallalPA.jpeg",
        "name": "Shrivastha Ballal",
        "address": "Collegeville, PA",
        "description": "Technologist, with Computer Science background , presently living in the suburbs of Philadelphia. Kannada and Tulu literature enthusiast with passion for fine arts, theatre arts , classical music and philosophy. Born and brought up in Udupi, moved to Bangalore in pursuit of greener pastures in mid 90's and subsequently to the US in 2000. Back in India as well as in the US engaged himself in various activities involving drama, movies and classical music concerts. Has penned articles in Kannada over the years on various topics including covering the events held across North America by Kannada Kootas and traveling artistes."
    }, {
        "title": "Director",
        "image": "committe/BOD/SRaoMA.jpeg",
        "name": "Dr. Sudhakar Rao",
        "address": "edfield, MA",
        "description": "Sudhakara Rao is a chemist by background and an IT professional by career. He hails from Bantwal Tq of Mangalore district and did  his Masters in Chemistry at Mysore University.After obtaining his Ph.D.from IISc, Bangalore he moved to Boston where he has been staying for the past 35 years.He engages himself in numerous community activities related to art, language and culture, particularly in relation to Kannada and Tulu.Over the last two decades, he has served in the local Kannada and Tulu Kootas under various capacities including as president.Currently he is heading the charity wing, Seva Mandaara, of New England Kannada Koota. He and his wife, Usha Rao, founded the charity organization, Kala Tarangini, to support programs that facilitate inculcating various traditional art forms of India in the 2n d generation Indians here in the US.Sudhakara runs weekly SuktaDhama classes where the attendees learn a methodical way of chanting Sanskrit verses with a touch of grammar.He is instrumental in running monthly Bhajans through Bhajana Tarangini and yearly Navaratri series called 'Mane Maneyalli Navaratri' through GKVV."
    }, {
        "title": "Director",
        "image": "committe/BOD/UANC.jpeg",
        "name": "Umesh Asaigoli",
        "address": "Morrisville, NC",
        "description": "Umesh Asaigoli is a software professional hailing from Asaigoli(near Konaje), Mangalore.Both paternal and maternal grandparents are from Kanyana - Karopady, Bantwal taluk and parents currently live at Kolya, Kotekar.His elder brother Vishwanath(who acted in a few Tulu and Kannada movies), younger sister Sharmila and younger brother Sharath.After completing early education from Deralakatte, higher school education from Mudipu, and PUC education from SDM college Ujire(Gurukula education from Siddavana Gurukula, Ujire, Dharmasthala), he graduated as Mechanical Engineer from NITK(formerly KREC) Surathkal.Umesh moved to the States in 1997 and currently lives in Raleigh, North Carolina with his wife Ranjani, son Suhan and daughter Sanvi.\nUmesh is passionate about Yakshagana, cultural stage activities and artwork.Besides charity work, he is actively involved in Tulu and Kannada community organizations.Umesh is the founding president of Triangle Tuluvere Chavadi, North Carolina and founder of the first online portal(2003 - 2015) that is dedicated to tulu culture and community around the world."
    }
]