[
    {
        "title": "President",
        "image": "committe/EC/BSherigarMA.jpeg",
        "name": "Bhaskar Sherigar",
        "address": "Andover, Boston, MA",
        "description": "Bhaskar Sherigar has been living in Andover Boston MA since 2008 with his wife Shailashree and kids Abhishek, Aniketh and Ansika.He moved to the United States from Bangalore after the startup he was working on was acquired by a US company. He is working in the field of Digital Video Technology - VLSI - IC Design, and named in 7 granted, 11 pending United States Patents as an Inventor. He has published research papers in national and international conferences. \n Born and brought up in Maala Karkala. His father is from Maala and mother is from Kellaputhige - Marnad in Moodabidri. After his early education in Mala - Karkala, had his Engineering education in Bagalkot and National Institute of Technology(NITK) Surathkal, India. He served as a Lecturer in Nitte Engineering college for a short period of time.\n He is one of the founding members of New England Tulu Koota(NETK) Boston USA and instrumental in driving its growth as President for two terms. A fervid enthusiast of Tulu Language, Literature, Culture and actively involved in Tulu drama, skits, dance, Yakshagana, etc. Bhaskar prides himself for knowing how to read and write in Tulu script. Besides Tulu Koota, he is also involved in Kannada Koota and an active member of other local Indian Associations.He is passionate about giving back to society in his own capacity by helping underprivileged schools in India."
    },
    {
        "title": "Vice-President",
        "image": "committe/EC/SShettyGA.jpeg",
        "name": "Shirish Shetty",
        "address": "Duluth, Atlanta, GA",
        "description": "Born and bought up in Mangalore City, did early schooling and college at St Aloysius and later Engineering from MIT, Manipal. Came to USA in 1988 to pursue MBA from Kansas State University.Initially moved to New Jersey area and later called Atlanta home since 1998. In the early years worked in the technology field but since 2001 has diversified into various business ventures. Currently have a diversified portfolio in Technology, Real Estate and Retail Sectors.\nMarried to Sandhya with 2 children - Ariyana, a Senior at Georgia Tech, and Aatish, a Sophomore at Georgia State. Shirish is an avid Tennis player and has a few accolades to his name.Has represented the State of Georgia in the USTA over 40 's  league tennis.\nA big proponent of Tulu language and talk only in Tulu at home and with family.As a family they have made it close to compulsory to visit Mangalore at least once or more every year and have done this since 2008 until COVID.President of BANA(Bunts Association of North America) from 2019 - 2022. Under his leadership BANA has been more active in trying to bring the community together with various initiatives and to keep the membership engaged.He has attended 13 out of the last 15 BANA Conventions.\nShirish, has also engaged in trying to help the underprivileged and especially during COVID he has helped various charities back in India."
    },
    {
        "title": "Secretary",
        "image": "committe/EC/PUdupaTX.jpeg",
        "name": "Prakash Udupa",
        "address": "Austin, TX",
        "description": "A techie by profession, moved to the Bay Area in 2007, living in Austin, TX, since 2010, with wife, 19 year old son, and 11 year old daughter.Grew up and educated in Bengaluru.Hearing all different Tulu dialects in and around grandparent 's house during summer visits helped him appreciate Tulu and learn to speak the mother tongue. \n Paternal ancestral home is in Harekala / Ambalamogaru village(en route from Thokkottu to Konaje), and maternal ancestral home is in Thokur near Haleangadi. \nSome inclination to art and various art forms as a kid helped him rekindle it after moving to the US.Now actively pursuing Kannada / Tamil / English professional stage theatre, also directing and acting in short movies. Being part of a Kerala Chenda MeLa group here, helped him learn the percussion instrument that was dear to his heart all the time."
    },
    {
        "title": "Joint-Secretary",
        "image": "committe/EC/PShettyMA.jpeg",
        "name": "Puja Shetty",
        "address": "Andover, MA",
        "description": "Puja Shetty is software engineer by profession working in the Pharma industry for over 20 years. Along with her husband Ashwin and daughter Sneha she lives in suburbs of the Boston Area. Always taking pride in her roots Puja has been associated with BANA(Bunts association of North America) as a member since her move to the US and is currently serving as one of the board members and the regional representative of New England area.She is grateful for having had the opportunity of serving a 2 term tenure(2015 to 2019) as the general secretary of the New England Tulu Koota in Boston where she got to introduce new members Into the fold thus connecting tuluvas in and around the New England area while also connecting with many others around the world. Puja has also been volunteering for the New England Kannada Koota Seva Mandaara(charity wing) since its inception in 2013. \n On the personal front she grew up In Bhadravathi, studied in malnad college of engineering in Hassan.Puja prides herself in being the grand daughter of Late Mrs. Leelavathi Rai first female MLA in Dakshina Kannada and lives by some of her guiding principles.Her father Sudhakar Rai is from Vitla, Kundadka and Kaidale and mother Geetha Rai is from Kodial Guthu and Bakrabail family and she has 1 brother Vikas Rai residing in Bangalore. \nPuja has great love for the tulu language, culture and cuisine and believes that she has learnt a lot from her New England tulu Koota family.She can speak tulu fluently and takes pride in learning to read and write in tulu in 2020 under the guidance of Satish Agpala from Kanaada and his tulu lipi online classes."
    },
    {
        "title": "Treasurer",
        "image": "committe/EC/SShettyCA.jpeg",
        "name": "Subhas Shetty",
        "address": "Milpitas, CA",
        "description": "A Software Engineer by profession, Subhas Shetty moved to the US in 1999 to Lowell, MA and has been living in California Bay Area since 2003 with his wife Prajna, son Dhyan and daughter Aaadhya.He was born and brought up in Kowdoor in Karkala Taluk with early education in Kanajar and Bailur.After completing his engineering from NMAMIT and a short stint in Bangalore, he moved to US. \n Subhas is an active member of Bunts Association of North America and involves himself in promoting Yakshagana, Tulu movies and any other activities to support Tulu language and its culture in the US.\nGrowing up in a family of amateur artists and litterateurs, Subhas has immense interest in preserving, protecting and developing Tulu language and the cultural heritage of the land."
    },
    {
        "title": "Joint-Treasurer",
        "image": "committe/EC/FFMA.jpeg",
        "name": "Fredrick Fernandes",
        "address": "Chelmsford, MA",
        "description": "Born in Moodubelle, Udupi district, Fredrick Fernandes is a post graduate in Personnel / HR management. He has been working in the field of HR in IT Industry for the past 30 years. He has been associated with New England Tulu Koota(NETK) since its inception.He speaks Tulu, Kannada, Konkani fluently and has been founding Secretary of NETK. Besides NETK, he is actively involved with MCA - New England, an association of Mangalorean Catholics from New England for the past 20 years."
    }
]